# Adult Data Set

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

Checking the data

In [3]:
pd.read_csv('adult.csv')

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32556,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32557,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32558,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32559,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

There is no columne in the data so it is taking the first row of the data to be as columns, we have change that and asign all the columns

In [4]:
df=pd.read_csv('adult.csv',header=None)

In [5]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

Now its not taking the first row as columns

In [6]:
columns=['age','workclass','fnlwgt','education','education-num','marital-status','occupation','relationship','race','sex','capital-gain','capital-loss','hours-per-week','native-country','salary']

Asigning all the columns

In [7]:
len(columns)

15

In [8]:
len(df.columns)

15

In [9]:
df.columns=columns

In [10]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

## Now we can start cleaning the data

## Check the shape of the data

In [11]:
print(f'Number of Columns are {df.shape[1]} \n Number of Rows are {df.shape[0]}')

Number of Columns are 15
 Number of Rows are 32561

## Check data type  and confirm with the dataset

In [12]:
df.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education-num      int64
marital-status    object
occupation        object
relationship      object
race              object
sex               object
capital-gain       int64
capital-loss       int64
hours-per-week     int64
native-country    object
salary            object
dtype: object

In [13]:
df.head(4)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K

## Geting overall info

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

## Separating Numerical columns and Categorical columns

In [15]:
df_num=[]
df_cat=[]

In [16]:
for i in df.columns:
    if df[i].dtype=='int64':
        df_num.append(i)
    else:
        df_cat.append(i)

In [17]:
df_num

['age',
 'fnlwgt',
 'education-num',
 'capital-gain',
 'capital-loss',
 'hours-per-week']

In [18]:
df_cat

['workclass',
 'education',
 'marital-status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'native-country',
 'salary']

In [19]:
print(f'Total Numerical Columns are {len(df_num)}. \nTotal Categorical Columns are {len(df_cat)}.')

Total Numerical Columns are 6.
Total Categorical Columns are 9.

In [20]:
df['hours-per-week'].groupby(df['native-country']).sum().sort_values(ascending=False)[:11]

native-country
 United-States    1179861
 Mexico             25939
 ?                  24202
 Philippines         7840
 Germany             5619
 Canada              4889
 Puerto-Rico         4397
 India               4153
 El-Salvador         3900
 England             3765
 Cuba                3720
Name: hours-per-week, dtype: int64

In [21]:
#there is quection mark in native-country column

In [22]:
df[df['native-country'] == " ?"]

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
14,40,Private,121772,Assoc-voc,11,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,0,0,40,?,>50K
38,31,Private,84154,Some-college,10,Married-civ-spouse,Sales,Husband,White,Male,0,0,38,?,>50K
51,18,Private,226956,HS-grad,9,Never-married,Other-service,Own-child,White,Female,0,0,30,?,<=50K
61,32,?,293936,7th-8th,4,Married-spouse-absent,?,Not-in-family,White,Male,0,0,40,?,<=50K
93,30,Private,117747,HS-grad,9,Married-civ-spouse,Sales,Wife,Asian-Pac-Islander,Female,0,1573,35,?,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32449,44,Self-emp-inc,71556,Masters,14,Married-civ-spouse,Sales,Husband,White,Male,0,0,50,?,>50K
32469,58,Self-emp-inc,181974,Doctorate,16,Never-married,Prof-specialty,Not-in-family,White,Female,0,0,99,?,<=50K
32492,42,Self-emp-not-inc,217597,HS-grad,9,Divorced,Sales,Own-child,White,Male,0,0,50,?,<=50K
32510,39,Private,107302,HS-grad,9,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,45,?,>50K
32525,81,?,120478,Assoc-voc,11,Divorced,?,Unmarried,White,Female,0,0,1,?,<=50K

In [23]:
#from this we can see that there is ? mark in wokclass, occupation aslo and there can be many more so relpace alll ? with null

In [24]:
df.replace(" ?",np.nan,inplace=True)

In [25]:
#checking for null values

In [26]:
df.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education-num        0
marital-status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country     583
salary               0
dtype: int64

In [27]:
#we have null values

In [28]:
df.shape

(32561, 15)

In [29]:
#they are many ways to handel null value but here as we have more data and froping them will not effect it so droping it

In [30]:
df.dropna(inplace=True)

In [31]:
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
salary            0
dtype: int64

In [32]:
df.shape

(30162, 15)

In [33]:
#for comfurmation purpuse that we dont have any useless values gona run value_count in all columns

In [34]:
for i in df.columns:
    print('*'*30)
    print(f"Column name: {i}")
    print(df[i].value_counts())
    print("--"*30)

******************************
Column name: age
36    852
31    851
33    837
34    836
37    828
     ...
82      7
83      5
88      3
85      3
86      1
Name: age, Length: 72, dtype: int64
------------------------------------------------------------
******************************
Column name: workclass
 Private             22286
 Self-emp-not-inc     2499
 Local-gov            2067
 State-gov            1279
 Self-emp-inc         1074
 Federal-gov           943
 Without-pay            14
Name: workclass, dtype: int64
------------------------------------------------------------
******************************
Column name: fnlwgt
203488    13
123011    12
113364    12
164190    12
121124    12
          ..
275818     1
318082     1
138342     1
158040     1
201490     1
Name: fnlwgt, Length: 20263, dtype: int64
------------------------------------------------------------
******************************
Column name: education
 HS-grad         9840
 Some-college    6678
 Bachelors       5044
 Masters         1627
 Assoc-voc       1307
 11th            1048
 Assoc-acdm      1008
 10th             820
 7th-8th          557
 Prof-school      542
 9th              455
 12th             377
 Doctorate        375
 5th-6th          288
 1st-4th          151
 Preschool         45
Name: education, dtype: int64
------------------------------------------------------------
******************************
Column name: education-num
9     9840
10    6678
13    5044
14    1627
11    1307
7     1048
12    1008
6      820
4      557
15     542
5      455
8      377
16     375
3      288
2      151
1       45
Name: education-num, dtype: int64
------------------------------------------------------------
******************************
Column name: marital-status
 Married-civ-spouse       14065
 Never-married             9726
 Divorced                  4214
 Separated                  939
 Widowed                    827
 Married-spouse-absent      370
 Married-AF-spouse           21
Name: marital-status, dtype: int64
------------------------------------------------------------
******************************
Column name: occupation
 Prof-specialty       4038
 Craft-repair         4030
 Exec-managerial      3992
 Adm-clerical         3721
 Sales                3584
 Other-service        3212
 Machine-op-inspct    1966
 Transport-moving     1572
 Handlers-cleaners    1350
 Farming-fishing       989
 Tech-support          912
 Protective-serv       644
 Priv-house-serv       143
 Armed-Forces            9
Name: occupation, dtype: int64
------------------------------------------------------------
******************************
Column name: relationship
 Husband           12463
 Not-in-family      7726
 Own-child          4466
 Unmarried          3212
 Wife               1406
 Other-relative      889
Name: relationship, dtype: int64
------------------------------------------------------------
******************************
Column name: race
 White                 25933
 Black                  2817
 Asian-Pac-Islander      895
 Amer-Indian-Eskimo      286
 Other                   231
Name: race, dtype: int64
------------------------------------------------------------
******************************
Column name: sex
 Male      20380
 Female     9782
Name: sex, dtype: int64
------------------------------------------------------------
******************************
Column name: capital-gain
0        27624
15024      337
7688       270
7298       240
99999      148
         ...
1639         1
6097         1
2538         1
1455         1
1086         1
Name: capital-gain, Length: 118, dtype: int64
------------------------------------------------------------
******************************
Column name: capital-loss
0       28735
1902      194
1977      162
1887      155
1848       50
        ...
2080        1
4356        1
1539        1
1844        1
1411        1
Name: capital-loss, Length: 90, dtype: int64
------------------------------------------------------------
******************************
Column name: hours-per-week
40    14251
50     2718
45     1753
60     1405
35     1184
      ...
82        1
94        1
92        1
87        1
74        1
Name: hours-per-week, Length: 94, dtype: int64
------------------------------------------------------------
******************************
Column name: native-country
 United-States                 27504
 Mexico                          610
 Philippines                     188
 Germany                         128
 Puerto-Rico                     109
 Canada                          107
 India                           100
 El-Salvador                     100
 Cuba                             92
 England                          86
 Jamaica                          80
 South                            71
 China                            68
 Italy                            68
 Dominican-Republic               67
 Vietnam                          64
 Guatemala                        63
 Japan                            59
 Poland                           56
 Columbia                         56
 Iran                             42
 Taiwan                           42
 Haiti                            42
 Portugal                         34
 Nicaragua                        33
 Peru                             30
 Greece                           29
 France                           27
 Ecuador                          27
 Ireland                          24
 Hong                             19
 Cambodia                         18
 Trinadad&Tobago                  18
 Thailand                         17
 Laos                             17
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         12
 Scotland                         11
 Holand-Netherlands                1
Name: native-country, dtype: int64
------------------------------------------------------------
******************************
Column name: salary
 <=50K    22654
 >50K      7508
Name: salary, dtype: int64
------------------------------------------------------------

In [35]:
#No useless values

In [36]:
 # we cann group mant vlaues in these columns marital-status,education

In [37]:
df['marital-status'].unique()

array([' Never-married', ' Married-civ-spouse', ' Divorced',
       ' Married-spouse-absent', ' Separated', ' Married-AF-spouse',
       ' Widowed'], dtype=object)

In [38]:
# can group ' Divorced' and ' Separated' as ---> ' Divorced'
#can group ' Married-civ-spouse', ' Married-spouse-absent'  and ' Married-AF-spouse' as ---> ' Married'
# can group ' Never-married' and ' Widowed' as ---> 'Not married'

In [39]:
for i in df['marital-status']:
    if i == ' Divorced' or i == ' Separated':
        df.replace(i,'Divorced',inplace = True)
    if i == ' Married-civ-spouse' or i == ' Married-spouse-absent' or i ==  ' Married-AF-spouse':
        df.replace(i,'Married',inplace = True)
    if i == ' Never-married' or i == ' Widowed':
        df.replace(i,'Not-married',inplace = True)

In [40]:
df['marital-status'].unique()

array(['Not-married', 'Married', 'Divorced'], dtype=object)

In [41]:
df['education'].unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' 7th-8th', ' Doctorate',
       ' Assoc-voc', ' Prof-school', ' 5th-6th', ' 10th', ' Preschool',
       ' 12th', ' 1st-4th'], dtype=object)

In [42]:
# can group ' Preschool', ' 1st-4th', ' 5th-6th', ' 7th-8th', ' 9th', ' 10th', ' 11th', ' 12th'  and ' HS-grad' as ---> 'School'
# can group ' Bachelors', ' Assoc-acdm', ' Assoc-voc' and ' Some-college' as ---> 'Under-grad'
# can group ' Prof-school', ' Doctorate',  and ' Masters' as ---> 'Post-grad'

In [43]:
for i in df['education']:
    
    if i in (' Preschool',' 1st-4th', ' 5th-6th', ' 7th-8th', ' 9th', ' 10th', ' 11th', ' 12th',' HS-grad'):
        df.replace(i,'School',inplace = True)
        
    if i in (' Bachelors', ' Assoc-acdm', ' Assoc-voc', ' Some-college' ):
        df.replace(i,'Under-grad',inplace = True)
        
    if i in (' Prof-school', ' Doctorate',' Masters'):
        df.replace(i,'Post-grad',inplace = True)

In [44]:
df['education'].unique()

array(['Under-grad', 'School', 'Post-grad'], dtype=object)

In [45]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Under-grad,13,Not-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Under-grad,13,Married,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,School,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,School,7,Married,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Under-grad,13,Married,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [46]:
df['workclass'].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' Self-emp-inc', ' Without-pay'], dtype=object)

In [47]:
# can group ' State-gov','' Federal-gov'' and ' Local-gov' as ---> 'Govt'
# can group ' Self-emp-not-inc' , ' Private' and ' Self-emp-inc' as ---> 'Corporate'
# can group ' Without-pay' as ---> ''

In [48]:
for i in df['workclass']:
    
    if i in (' State-gov', ' Federal-gov', ' Local-gov' ):
        df.replace(i,'Govt',inplace = True)
        
    if i in (' Self-emp-not-inc' , ' Private', ' Self-emp-inc' ):
        df.replace(i,'Corporate',inplace = True)

In [49]:
df['workclass'].unique()

array(['Govt', 'Corporate', ' Without-pay'], dtype=object)

In [50]:
df['occupation'].unique()

array([' Adm-clerical', ' Exec-managerial', ' Handlers-cleaners',
       ' Prof-specialty', ' Other-service', ' Sales', ' Transport-moving',
       ' Farming-fishing', ' Machine-op-inspct', ' Tech-support',
       ' Craft-repair', ' Protective-serv', ' Armed-Forces',
       ' Priv-house-serv'], dtype=object)

In [51]:

#Types of Occupation: a. Profession b. Employment and c. Business.

In [52]:
df['relationship'].unique()

array([' Not-in-family', ' Husband', ' Wife', ' Own-child', ' Unmarried',
       ' Other-relative'], dtype=object)

In [53]:
# can group ' Husband',' Wife' and ' Own-child' as ---> 'Parent'
# can group ' Not-in-family',' Unmarried' and ' Other-relative' as ---> 'Alone'

In [54]:
for i in df['relationship']:
    
    if i in (' Husband',' Wife' , ' Own-child' ):
        df.replace(i,'Parent',inplace = True)
        
    if i in (' Not-in-family',' Unmarried', ' Other-relative' ):
        df.replace(i,'Alone',inplace = True)

In [55]:
df['relationship'].unique()

array(['Alone', 'Parent'], dtype=object)

In [56]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,Govt,77516,Under-grad,13,Not-married,Adm-clerical,Alone,White,Male,2174,0,40,United-States,<=50K
1,50,Corporate,83311,Under-grad,13,Married,Exec-managerial,Parent,White,Male,0,0,13,United-States,<=50K
2,38,Corporate,215646,School,9,Divorced,Handlers-cleaners,Alone,White,Male,0,0,40,United-States,<=50K
3,53,Corporate,234721,School,7,Married,Handlers-cleaners,Parent,Black,Male,0,0,40,United-States,<=50K
4,28,Corporate,338409,Under-grad,13,Married,Prof-specialty,Parent,Black,Female,0,0,40,Cuba,<=50K

In [57]:
#data grouping and cleaning is done

In [58]:
pd.DataFrame(df['workclass'].groupby([df['workclass'],df['education']]).count())

                         workclass
workclass    education
 Without-pay School             10
             Under-grad          4
Corporate    Post-grad        1767
             School          12308
             Under-grad      11784
Govt         Post-grad         777
             School           1263
             Under-grad       2249

In [59]:
#in corporate many people are from scholl background
#in Govt many people are under-grad

In [60]:
pd.DataFrame(df['workclass'].groupby([df['sex'],df['workclass'],df['education']]).count())

                                 workclass
sex     workclass    education
 Female  Without-pay School              3
                     Under-grad          2
        Corporate    Post-grad         378
                     School           3775
                     Under-grad       4007
        Govt         Post-grad         299
                     School            448
                     Under-grad        870
 Male    Without-pay School              7
                     Under-grad          2
        Corporate    Post-grad        1389
                     School           8533
                     Under-grad       7777
        Govt         Post-grad         478
                     School            815
                     Under-grad       1379

In [61]:
df.to_csv('Adult_cleaned.csv')

### Model Building

In [62]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,Govt,77516,Under-grad,13,Not-married,Adm-clerical,Alone,White,Male,2174,0,40,United-States,<=50K
1,50,Corporate,83311,Under-grad,13,Married,Exec-managerial,Parent,White,Male,0,0,13,United-States,<=50K
2,38,Corporate,215646,School,9,Divorced,Handlers-cleaners,Alone,White,Male,0,0,40,United-States,<=50K
3,53,Corporate,234721,School,7,Married,Handlers-cleaners,Parent,Black,Male,0,0,40,United-States,<=50K
4,28,Corporate,338409,Under-grad,13,Married,Prof-specialty,Parent,Black,Female,0,0,40,Cuba,<=50K

In [63]:
#for this model not gone use native-country

In [64]:
df.drop('native-country',axis = 1 , inplace = True)

In [66]:
df['workclass'].value_counts()

Corporate       25859
Govt             4289
 Without-pay       14
Name: workclass, dtype: int64

In [67]:
'''Corporate ----> 0
Govt -----> 1      
 Without-pay ----> 2'''

'Corporate ----> 0\nGovt -----> 1      \n Without-pay ----> 2'

In [70]:
df['workclass'].replace(['Corporate', 'Govt', ' Without-pay'],[0,1,2],inplace = True)

In [71]:
df['workclass'].value_counts()

0    25859
1     4289
2       14
Name: workclass, dtype: int64

In [72]:
df['education'].value_counts()

Under-grad    14037
School        13581
Post-grad      2544
Name: education, dtype: int64

In [73]:
'''Under-grad ----> 0
School -----> 1      
 Post-grad ----> 2'''

'Under-grad ----> 0\nSchool -----> 1      \n Post-grad ----> 2'

In [76]:
df['education'].replace(['Under-grad', 'School', 'Post-grad'],[0,1,2],inplace = True)

In [77]:
df['education'].value_counts()

0    14037
1    13581
2     2544
Name: education, dtype: int64

In [78]:
df['marital-status'].value_counts()

Married        14456
Not-married    10553
Divorced        5153
Name: marital-status, dtype: int64

In [80]:
'''Married ----> 0
Not-married -----> 1      
 Divorced ----> 2'''

'Married ----> 0\nNot-married -----> 1      \n Divorced ----> 2'

In [81]:
df['marital-status'].replace(['Married', 'Not-married', 'Divorced'],[0,1,2],inplace = True)

In [82]:
df['marital-status'].value_counts()

0    14456
1    10553
2     5153
Name: marital-status, dtype: int64

In [83]:
df['relationship'].value_counts()

Parent    18335
Alone     11827
Name: relationship, dtype: int64

In [84]:
'''Parent ----> 0
Alone---> 1'''

'Parent ----> 0\nAlone---> 1'

In [85]:
df['relationship'].replace(['Parent', 'Alone'],[0,1],inplace = True)

In [86]:
df['relationship'].value_counts()

0    18335
1    11827
Name: relationship, dtype: int64

In [87]:
df['race'].value_counts()

 White                 25933
 Black                  2817
 Asian-Pac-Islander      895
 Amer-Indian-Eskimo      286
 Other                   231
Name: race, dtype: int64

In [88]:
'''White ----> 0
Black -----> 1      
 Asian-Pac-Islander ----> 2
 Amer-Indian-Eskimo ---> 3
 Other ----> 4'''

'White ----> 0\nBlack -----> 1      \n Asian-Pac-Islander ----> 2\n Amer-Indian-Eskimo ---> 3\n Other ----> 4'

In [94]:
df['race'].replace([' White', ' Black',' Asian-Pac-Islander',' Amer-Indian-Eskimo',' Other'],[0,1,2,3,4],inplace = True)

In [95]:
df['race'].value_counts()

0    25933
1     2817
2      895
3      286
4      231
Name: race, dtype: int64

In [96]:
df['sex'].value_counts()

 Male      20380
 Female     9782
Name: sex, dtype: int64

In [98]:
'''Male ----> 0
Male -----> 1      
 '''

'Male ----> 0\nMale -----> 1      \n '

In [104]:
df['sex'].replace([' Male', ' Female'],[0,1],inplace = True)

In [105]:
df['sex'].value_counts()

0    20380
1     9782
Name: sex, dtype: int64

In [106]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,salary
0,39,1,77516,0,13,1,Adm-clerical,1,0,0,2174,0,40,<=50K
1,50,0,83311,0,13,0,Exec-managerial,0,0,0,0,0,13,<=50K
2,38,0,215646,1,9,2,Handlers-cleaners,1,0,0,0,0,40,<=50K
3,53,0,234721,1,7,0,Handlers-cleaners,0,1,0,0,0,40,<=50K
4,28,0,338409,0,13,0,Prof-specialty,0,1,1,0,0,40,<=50K

In [110]:
df['occupation'].unique()

array([' Adm-clerical', ' Exec-managerial', ' Handlers-cleaners',
       ' Prof-specialty', ' Other-service', ' Sales', ' Transport-moving',
       ' Farming-fishing', ' Machine-op-inspct', ' Tech-support',
       ' Craft-repair', ' Protective-serv', ' Armed-Forces',
       ' Priv-house-serv'], dtype=object)

In [111]:
occupation = {}
for i in range(len(df['occupation'].unique())):
    occupation[df['occupation'].unique()[i]] = i

In [112]:
occupation

{' Adm-clerical': 0,
 ' Exec-managerial': 1,
 ' Handlers-cleaners': 2,
 ' Prof-specialty': 3,
 ' Other-service': 4,
 ' Sales': 5,
 ' Transport-moving': 6,
 ' Farming-fishing': 7,
 ' Machine-op-inspct': 8,
 ' Tech-support': 9,
 ' Craft-repair': 10,
 ' Protective-serv': 11,
 ' Armed-Forces': 12,
 ' Priv-house-serv': 13}

In [113]:
df['occupation'].replace(occupation.keys(),occupation.values(),inplace=True)

In [115]:
df['occupation'].value_counts()

3     4038
10    4030
1     3992
0     3721
5     3584
4     3212
8     1966
6     1572
2     1350
7      989
9      912
11     644
13     143
12       9
Name: occupation, dtype: int64

In [126]:
df['salary'].unique()

array([' <=50K', ' >50K'], dtype=object)

In [129]:
df['salary'].replace([' <=50K', ' >50K'],[0,1],inplace= True)

In [130]:
df['salary'].value_counts()

0    22654
1     7508
Name: salary, dtype: int64

In [131]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,salary
0,39,1,77516,0,13,1,0,1,0,0,2174,0,40,0
1,50,0,83311,0,13,0,1,0,0,0,0,0,13,0
2,38,0,215646,1,9,2,2,1,0,0,0,0,40,0
3,53,0,234721,1,7,0,2,0,1,0,0,0,40,0
4,28,0,338409,0,13,0,3,0,1,1,0,0,40,0

In [132]:
#all columes are now coverted to numerical data

In [133]:
df.to_csv('adult_model_data.csv')

In [157]:
X = df.drop('salary', axis=1)
y = df['salary']

In [158]:
## Spleting the data

In [159]:
from sklearn.model_selection import train_test_split

In [160]:
X_train, x_test,y_train,y_test = train_test_split(X,y,test_size=0.33,random_state=35)

In [161]:
#scaling the data

In [162]:
from sklearn.preprocessing import StandardScaler

In [163]:
scaler = StandardScaler()
scaler

StandardScaler()

In [164]:
X_train = scaler.fit_transform(X_train)

In [144]:
X_train

array([[-1.55698066, -0.40909586, -0.32505218, ..., -0.14633167,
        -0.21647546, -2.92597453],
       [ 1.71707694, -0.40909586, -0.5731638 , ..., -0.14633167,
        -0.21647546,  0.59870998],
       [ 1.5647952 , -0.40909586,  0.87061004, ..., -0.14633167,
        -0.21647546, -0.07265849],
       ...,
       [-0.64329016, -0.40909586,  0.25224174, ..., -0.14633167,
        -0.21647546, -0.07265849],
       [-0.79557191,  2.42498339,  1.03718896, ..., -0.14633167,
        -0.21647546,  0.3469468 ],
       [ 0.27040033, -0.40909586, -0.05480061, ..., -0.14633167,
        -0.21647546, -0.07265849]])

In [165]:
x_test = scaler.transform(x_test)

In [166]:
x_test

array([[-0.79557191, -0.40909586,  0.98748962, ..., -0.14633167,
        -0.21647546, -0.07265849],
       [ 0.87952733, -0.40909586,  1.43252151, ..., -0.14633167,
         3.49045812, -0.07265849],
       [-0.33872667,  2.42498339, -0.6862026 , ..., -0.14633167,
        -0.21647546, -1.75107969],
       ...,
       [-0.71943104, -0.40909586,  0.45865328, ..., -0.14633167,
        -0.21647546, -0.07265849],
       [-0.94785366, -0.40909586,  1.3892235 , ..., -0.14633167,
        -0.21647546, -0.07265849],
       [ 0.87952733,  2.42498339, -1.33427691, ...,  0.4157982 ,
        -0.21647546,  1.1861574 ]])

##### Building The model LogisticRegression

In [169]:
from sklearn.linear_model import LogisticRegression

In [170]:
model = LogisticRegression()
model

LogisticRegression()

In [171]:
model.fit(X_train,y_train)

LogisticRegression()

In [172]:
model.score(X_train,y_train)

0.8369952494061758

In [173]:
y_pred = model.predict(x_test)

In [175]:
from sklearn.metrics import classification_report

In [177]:
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.85      0.93      0.89      7414
           1       0.73      0.53      0.62      2540

    accuracy                           0.83      9954
   macro avg       0.79      0.73      0.75      9954
weighted avg       0.82      0.83      0.82      9954

##### Building The model SVC

In [179]:
from sklearn.svm import SVC

In [180]:
model_1 = SVC()
model_1

SVC()

In [181]:
model_1.fit(X_train,y_train)

SVC()

In [182]:
model_1.score(X_train,y_train)

0.853424386381631

In [183]:
y_pred = model_1.predict(x_test)

In [185]:
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.86      0.94      0.90      7414
           1       0.77      0.55      0.64      2540

    accuracy                           0.84      9954
   macro avg       0.81      0.75      0.77      9954
weighted avg       0.84      0.84      0.83      9954